In [1]:
# Queries

import pandas as pd
import sqlite3

conn = sqlite3.connect("/Users/thomassimmons/Downloads/chinook-database-master/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite")

In [4]:
pd.read_sql("""SELECT FirstName, LastName, Country
            FROM Customer
            WHERE Country = 'USA';
            """, conn)

   FirstName    LastName Country
0      Frank      Harris     USA
1       Jack       Smith     USA
2   Michelle      Brooks     USA
3        Tim       Goyer     USA
4        Dan      Miller     USA
5      Kathy       Chase     USA
6    Heather     Leacock     USA
7       John      Gordon     USA
8      Frank     Ralston     USA
9     Victor     Stevens     USA
10   Richard  Cunningham     USA
11   Patrick        Gray     USA
12     Julia     Barnett     USA

In [2]:
pd.read_sql("PRAGMA table_info", conn)

Empty DataFrame
Columns: [cid, name, type, notnull, dflt_value, pk]
Index: []

In [5]:
pd.read_sql("""SELECT COUNT(*) AS total_invoices
            FROM Invoice;""", conn)

   total_invoices
0             412

In [6]:
pd.read_sql(""" SELECT COUNT(TOTAL) AS avg_invoice_total
            FROM Invoice;""", conn)

   avg_invoice_total
0                412

In [7]:
pd.read_sql("""WITH RankedInvoices AS (
    SELECT *,
            RANK() OVER (PARTITION BY BillingCountry
            ORDER BY Total DESC) AS Rank
            FROM Invoice
)
SELECT * 
FROM RankedInvoices
WHERE rank <= 3;""", conn)

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total,Rank
0,348,56,2013-03-10 00:00:00,307 Macacha GÃ¼emes,Buenos Aires,None,Argentina,1106,13.86,1
1,403,56,2013-11-08 00:00:00,307 Macacha GÃ¼emes,Buenos Aires,None,Argentina,1106,8.91,2
2,164,56,2010-12-17 00:00:00,307 Macacha GÃ¼emes,Buenos Aires,None,Argentina,1106,5.94,3
3,250,55,2012-01-01 00:00:00,421 Bourke Street,Sidney,NSW,Australia,2010,13.86,1
4,305,55,2012-08-31 00:00:00,421 Bourke Street,Sidney,NSW,Australia,2010,8.91,2
...,...,...,...,...,...,...,...,...,...,...
80,201,25,2011-05-29 00:00:00,319 N. Frances Street,Madison,WI,USA,53703,18.86,2
81,103,24,2010-03-21 00:00:00,162 E Superior Street,Chicago,IL,USA,60611,15.86,3
82,54,53,2009-08-16 00:00:00,113 Lupus St,London,None,United Kingdom,SW1V 3EN,13.86,1
83,152,54,2010-10-24 00:00:00,110 Raeburn Pl,Edinburgh,None,United Kingdom,EH4 1HH,13.86,1
84,369,52,2013-06-11 00:00:00,202 Hoxton Street,London,None,United Kingdom,N1 5LH,13.86,1

In [2]:
import pandas as pd
import numpy as np

# Load sample data
df = pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv")